kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  // Fill remaining bits with silence if any
  while (k < BITSTREAM_LENGTH) {
    bitstream[k++] = 2; // silence
  }
}

void update_input_string(void) {
  input_string[0] = '\0';
  size_t offset = 0;
  size_t remaining = MAX_NUM_CHARS;
  int n = 0;

  // Append USER_STRING if enabled
  if (INCLUDE_USER_STRING) {
    n = snprintf(&input_string[offset], remaining, "/STR%s", USER_STRING);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append DEVICE_ID if enabled
  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&input_string[offset], remaining, "%s/DID%d",
                 (offset > 0) ? "" : "", DEVICE_ID);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append LOCATION if enabled
  if (INCLUDE_LOCATION) {
    n = snprintf(&input_string[offset], remaining, "%s/LOC%s",
                 (offset > 0) ? "" : "", LOCATION);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append TEMPERATURE if enabled
  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&input_string[offset], remaining, "%s/TMP%d",
                 (offset > 0) ? "" : "", temp_int);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append TIME if enabled
  if (INCLUDE_TIME) {
    n = snprintf(&input_string[offset], remaining,
                 "%s/TIM%02d%02d%02d%02d%02d%02d%04d", (offset > 0) ? "" : "",
                 now.hours, now.minutes, now.seconds, now.day, now.date,
                 now.month, now.year);

    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Add termination sign
  if (strlen(input_string) > 0) {
    n = snprintf(&input_string[offset], remaining, "/");
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
}

// Function to generate sine wave lookup table for low frequency
void get_sineval_low(void) {
  if (!sine_val_low || freq_pair.lower_freq_samples == 0) {
    return; // eller Error_Handler()
  }

  for (uint16_t i = 0; i < freq_pair.lower_freq_samples; i++) {
    sine_val_low[i] =
        (uint32_t)((4095.0 / 2.0) *
                   (1.0 + sinf(2.0 * pi * i / freq_pair.lower_freq_samples) *
                              (1.5 / 1.65)));
  }
}

// Function to generate sine wave lookup table for the high frequency
void get_sineval_high(void) {
  if (!sine_val_high || freq_pair.higher_freq_samples == 0) {
    return; // eller Error_Handler()
  }

  for (uint16_t i = 0; i < freq_pair.higher_freq_samples; i++) {
    sine_val_high[i] =
        (uint32_t)((4095.0 / 2.0) *
                   (1.0 + sinf(2.0 * pi * i / freq_pair.higher_freq_samples) *
                              (1.5 / 1.65)));
  }
}

void get_dc_mid(void) {
  if (!dc_mid || freq_pair.lower_freq_samples == 0) {
    return; // eller Error_Handler()
  }

  uint32_t mid_value = (uint32_t)(4095.0 / 2.0);
  for (uint16_t i = 0; i < freq_pair.lower_freq_samples; i++) {
    dc_mid[i] = mid_value;
  }
}

uint32_t get_dac_sample_rate_hz(void) {
  uint32_t tim_clk = HAL_RCC_GetPCLK1Freq();
  if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1)
    tim_clk *= 2; // timer clock doubled if APB prescaler != 1

  return tim_clk / ((htim2.Init.Prescaler + 1) * (htim2.Init.Period + 1));
}

void calculate_active_duration_ms(size_t bitstream_len) {
  fs = get_dac_sample_rate_hz();

  float f_0 = (float)fs / (float)freq_pair.lower_freq_samples;
  float f_1 = (float)fs / (float)freq_pair.higher_freq_samples;

  f_0_bit_duration = (float)freq_pair.lower_freq_periods / f_0;
  f_1_bit_duration = (float)freq_pair.higher_freq_periods / f_1;

  // Exact bitstream time
  total_time = 0.0f;
  for (int i = 0; i < bitstream_len; ++i) {
    if (bitstream[i] == 0) {
      total_time += ((float)freq_pair.lower_freq_periods) / f_0;
    } else if (bitstream[i] == 1) {
      total_time += (float)freq_pair.higher_freq_periods / f_1;
    } else {
      total_time += ((float)freq_pair.lower_freq_periods) / f_0; // silence
    }
  }

  // Add silence time
  // total_time *= 1.05f;                            // 5% margin
  // total_time += cable_speaker_delay_ms / 1000.0f; // 10ms margin
}

static inline FillResult
fill_half_buffer(uint32_t *buffer, size_t generation_size,
                 const uint8_t *bitstream, size_t bitstream_len,
                 size_t bit_index, size_t current_sine_period,
                 size_t current_sine_index) {
  size_t out = 0;
  size_t period = current_sine_period;
  size_t idx = current_sine_index;

  while (out < generation_size) {
    // If finished, just output mid forever (prevents repeats)
    if (bit_index >= bitstream_len) {
      for (; out < generation_size; ++out) {
        buffer[out] = dc_mid[0];
      }
      break;
    }

    uint8_t cur_bit = bitstream[bit_index];

    /* Select LUT + target periods for THIS bit */
    const uint32_t *lut;
    size_t lut_len;
    size_t target_periods;

    if (cur_bit == 0) {
      lut = sine_val_low;
      lut_len = freq_pair.lower_freq_samples;
      target_periods = freq_pair.lower_freq_periods;
    } else if (cur_bit == 1) {
      lut = sine_val_high;
      lut_len = freq_pair.higher_freq_samples;
      target_periods = freq_pair.higher_freq_periods;
    } else { // silence
      lut = dc_mid;
      lut_len = freq_pair.lower_freq_samples;
      target_periods = freq_pair.lower_freq_periods;
    }

    /* Copy as much as we can from current LUT position */
    size_t left_buf = generation_size - out;
    size_t left_lut = lut_len - idx;
    size_t n = (left_buf < left_lut) ? left_buf : left_lut;

    memcpy(&buffer[out], &lut[idx], n * sizeof(uint32_t));
    out += n;
    idx += n;

    /* Completed one period? */
    if (idx == lut_len) {
      idx = 0;
      period++;

      /* Completed this bit? -> advance to next bit */
      if (period == target_periods) {
        period = 0;
        if (bit_index + 1u < bitstream_len) {
          bit_index++;
        } else {
          // reached end -> hold at end
          bit_index = bitstream_len;
        }
      }
    }
  }

