kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  return (FillResult){
      .bit_index = bit_index, .current_period = period, .current_index = idx};
}

// DMA Half Transfer Complete callback
void HAL_DAC_ConvHalfCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  FillResult r =
      fill_half_buffer((uint32_t *)&output_buffer[0], BUFFER_SIZE / 2,
                       bitstream, BITSTREAM_LENGTH, current_bitstream_index,
                       current_sine_period, current_sine_index);

  current_bitstream_index = r.bit_index;
  current_sine_period = r.current_period;
  current_sine_index = r.current_index;
}

// DMA Transfer Complete callback
void HAL_DAC_ConvCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  FillResult r = fill_half_buffer((uint32_t *)&output_buffer[BUFFER_SIZE / 2],
                                  BUFFER_SIZE / 2, bitstream, BITSTREAM_LENGTH,
                                  current_bitstream_index, current_sine_period,
                                  current_sine_index);

  current_bitstream_index = r.bit_index;
  current_sine_period = r.current_period;
  current_sine_index = r.current_index;
}

static void TX_Start(void) {
  LOGF("\r\nTX_Start()\r\n");

  current_bitstream_index = 0;
  current_sine_period = 0;
  current_sine_index = 0;
  tx_active = true;

  FillResult r1 =
      fill_half_buffer((uint32_t *)&output_buffer[0], BUFFER_SIZE / 2,
                       bitstream, BITSTREAM_LENGTH, current_bitstream_index,
                       current_sine_period, current_sine_index);

  current_bitstream_index = r1.bit_index;
  current_sine_period = r1.current_period;
  current_sine_index = r1.current_index;

  FillResult r2 = fill_half_buffer((uint32_t *)&output_buffer[BUFFER_SIZE / 2],
                                   BUFFER_SIZE / 2, bitstream, BITSTREAM_LENGTH,
                                   current_bitstream_index, current_sine_period,
                                   current_sine_index);

  current_bitstream_index = r2.bit_index;
  current_sine_period = r2.current_period;
  current_sine_index = r2.current_index;

  LOGF("  Buffer filled\r\n");

  // Clean start
  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);
  HAL_DAC_Stop(&hdac1, DAC_CHANNEL_1);

  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  LOGF("  Peripherals stopped & DMA flags cleared\r\n");

  // Start DAC
  HAL_StatusTypeDef st;
  st = HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);
  if (st != HAL_OK) {
    LOGF("  HAL_DAC_Start error: %d\r\n", st);
    Error_Handler_Code(STATUS_CODE_TRANSMISSION_ERROR);
  } else {
    LOGF("  HAL_DAC_Start OK\r\n");
  }

  // Start DMA
  st = HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                         BUFFER_SIZE, DAC_ALIGN_12B_R);

  if (st != HAL_OK) {
    LOGF("  HAL_DAC_Start_DMA error: %d\r\n", st);
    Error_Handler_Code(STATUS_CODE_TRANSMISSION_ERROR);
  } else {
    LOGF("  HAL_DAC_Start_DMA OK\r\n");
  }

  // Ensure trigger enabled
  SET_BIT(DAC1->CR, DAC_CR_TEN1);

  // Start timer last
  __HAL_TIM_SET_COUNTER(&htim2, 0);
  st = HAL_TIM_Base_Start(&htim2);

  if (st != HAL_OK) {
    LOGF("  HAL_TIM_Base_Start error: %d\r\n", st);
    Error_Handler_Code(STATUS_CODE_TRANSMISSION_ERROR);
  } else {
    LOGF("  HAL_TIM_Base_Start OK\r\n");
  }
}

static void TX_Stop(void) {
  LOGF("TX_Stop()\r\n");

  tx_active = false;

  // Stop trigger + DMA first
  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);

  Set_DAC_Output_To_Midlevel();

  // Optional: if you want to *keep* the mid DC during STOP, leave DAC
  // running. If you want lowest power, stop it (output may go undefined
  // depending on buffer mode): HAL_DAC_Stop(&hdac1, DAC_CHANNEL_1);

  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  LOGF("  TX stopped cleanly (DAC set to mid)\r\n");
}

void Set_DAC_Output_To_Midlevel(void) {
  CLEAR_BIT(DAC1->CR, DAC_CR_TEN1);

  // Ensure DAC channel is enabled
  HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);

  // Set mid-scale (12-bit right aligned)
  HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dc_mid[0]);
}

void string_to_hex(const char *str, uint8_t *hex_buf, size_t hex_buf_size) {
  size_t str_len = strlen(str);
  size_t max_bytes =
      (hex_buf_size < (str_len / 2)) ? hex_buf_size : (str_len / 2);

  for (size_t i = 0; i < max_bytes; i++) {
    sscanf(&str[i * 2], "%2hhx", &hex_buf[i]);
  }
}

void process_transmission(const uint8_t *transmission, int *dBm_value) {
  size_t len = strlen((const char *)transmission);
  if (len <= 4) {
    LOGF("Transmission too short to process.\r\n");
    return;
  }

  for (size_t i = 0; i < len; i++) {
    LOGF("%02X ", transmission[i]);
  }
  LOGF("\r\n");

  uint8_t rssi_hex = transmission[len - 2]; // 2nd from end

  // LOGF("Extracted RSSI hex: %02X\r\n", rssi_hex);

  int8_t rssi_signed = (int8_t)rssi_hex; // 2's complement

  // LOGF("RSSI signed value: %d\r\n", rssi_signed);

  int rssi_dbm = (rssi_signed / 2) - 74; // integer dBm

  // LOGF("RSSI: %d dBm\r\n", rssi_dbm);

  dBm_value[0] = (int)rssi_dbm;

  // Create cleaned string: skip first 2 char, skip last 2 chars
  size_t cleaned_len = (len > 4) ? (len - 4) : 0;
  char cleaned_str[MAX_NUM_CHARS] = {0};
  if (cleaned_len > 0) {
    strncpy(cleaned_str, (const char *)transmission + 2, cleaned_len);
    cleaned_str[cleaned_len] = '\0'; // Null-terminate
  }

  // Overwrite the transmission parameter (cast needed for const)
  strncpy((char *)transmission, cleaned_str, MAX_NUM_CHARS - 1);
}

void create_string_from_received_data(const uint8_t *transmission,
                                      int dBm_value, char *output_str,
                                      size_t output_str_size) {
  if (!output_str || output_str_size == 0)
    return;

  // Clear the entire output string buffer to ensure no leftover data, and set
  // first char to null for safe concatenation
  memset(output_str, 0, output_str_size);
  output_str[0] = '\0';

  // Initialize with default values
  char user_string[64] = USER_STRING; // fallback from user_config.h
  int device_id = DEVICE_ID;          // fallback from user_config.h
  char location[64] = LOCATION;       // fallback from user_config.h
  int temperature = temp_int;         // runtime value
  rtc_time_t time_val = now;          // runtime value

  // Copy transmission to local buffer for tokenization
  char buf[256];
  size_t in_len = strnlen((const char *)transmission, sizeof(buf) - 1);
  memcpy(buf, transmission, in_len);
  buf[in_len] = '\0';

  // Parse tokens in the format /KEYvalue, where KEY is 3 chars and value is
  // variable length, separated by '/'
  for (char *tok = strtok(buf, "/"); tok != NULL; tok = strtok(NULL, "/")) {

    if (strncmp(tok, "STR", 3) == 0) {
      strncpy(user_string, tok + 3, sizeof(user_string) - 1);
      user_string[sizeof(user_string) - 1] = '\0';

