kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
    } else if (strncmp(tok, "DID", 3) == 0) {
      device_id = atoi(tok + 3);

    } else if (strncmp(tok, "LOC", 3) == 0) {
      strncpy(location, tok + 3, sizeof(location) - 1);
      location[sizeof(location) - 1] = '\0';

    } else if (strncmp(tok, "TMP", 3) == 0) {
      temperature = atoi(tok + 3);

    } else if (strncmp(tok, "TIM", 3) == 0) {
      const char *p = tok + 3;
      if (strlen(p) >= 14) {
        char t[3] = {0};

        t[0] = p[0];
        t[1] = p[1];
        time_val.hours = (uint8_t)atoi(t);
        t[0] = p[2];
        t[1] = p[3];
        time_val.minutes = (uint8_t)atoi(t);
        t[0] = p[4];
        t[1] = p[5];
        time_val.seconds = (uint8_t)atoi(t);
        t[0] = p[6];
        t[1] = p[7];
        time_val.day = (uint8_t)atoi(t);
        t[0] = p[8];
        t[1] = p[9];
        time_val.date = (uint8_t)atoi(t);
        t[0] = p[10];
        t[1] = p[11];
        time_val.month = (uint8_t)atoi(t);

        char y[5] = {p[12], p[13], p[14], p[15], 0};
        time_val.year = (uint16_t)atoi(y);
      }
    }
  }

  // Build output string based on parsed tokens and compile-time flags, with
  // careful buffer management
  size_t offset = 0;
  size_t remaining = output_str_size;
  int n = 0;

  output_str[0] = '\0';

  if (INCLUDE_USER_STRING) {
    n = snprintf(&output_str[offset], remaining, "/STR%s", user_string);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&output_str[offset], remaining, "%s/DID%d",
                 (offset > 0) ? "" : "", device_id);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_LOCATION) {
    n = snprintf(&output_str[offset], remaining, "%s/LOC%s",
                 (offset > 0) ? "" : "", location);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&output_str[offset], remaining, "%s/TMP%d",
                 (offset > 0) ? "" : "", temperature);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_TIME) {
    n = snprintf(&output_str[offset], remaining,
                 "%s/TIM%02d%02d%02d%02d%02d%02d%04d", (offset > 0) ? "" : "",
                 time_val.hours, time_val.minutes, time_val.seconds,
                 time_val.day, time_val.date, time_val.month, time_val.year);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  // Add termination slash
  if (strlen(output_str) > 0) {
    n = snprintf(&output_str[offset], remaining, "/");
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  // Optional: append RSSI info for debug/logging
  // snprintf(&output_str[offset], remaining, " RSSI=%d dBm", dBm_value);

  // Hard guarantee null-termination
  output_str[output_str_size - 1] = '\0';
}

static int init_luts_from_freqpair(void) {
  // frigjør hvis de finnes fra før
  free(sine_val_low);
  sine_val_low = NULL;
  free(sine_val_high);
  sine_val_high = NULL;
  free(dc_mid);
  dc_mid = NULL;

  sine_val_low = malloc(freq_pair.lower_freq_samples * sizeof(uint32_t));
  sine_val_high = malloc(freq_pair.higher_freq_samples * sizeof(uint32_t));
  dc_mid = malloc(freq_pair.lower_freq_samples * sizeof(uint32_t));

  if (!sine_val_low || !sine_val_high || !dc_mid) {
    free(sine_val_low);
    sine_val_low = NULL;
    free(sine_val_high);
    sine_val_high = NULL;
    free(dc_mid);
    dc_mid = NULL;
    return -1;
  }
  return 0;
}

void Error_Handler_Code(status_code_t code) {
  g_error_code = code;
  Error_Handler(); // call the CubeMX-compatible one
}

int _write(int file, char *ptr, int len) {
  (void)file;
  HAL_UART_Transmit(&huart2, (uint8_t *)ptr, len, 100);
  return len;
}

uint16_t Read_Battery_Voltage_mV(void) {
  uint32_t adc_value = 0;
  uint16_t voltage_mV = 0;

  // Read ADC value
  HAL_ADC_Start(&hadc1);
  if (HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY) == HAL_OK) {
    adc_value = HAL_ADC_GetValue(&hadc1);
  }
  HAL_ADC_Stop(&hadc1);

  // Convert ADC value to millivolts (assuming 12-bit ADC and 3.3V reference)
  // Input voltage is divided by 2 due to external voltage divider (1M and 1M),
  // so we multiply by 2 to compensate
  printf("Raw ADC value: %lu\r\n", adc_value);
  voltage_mV = (uint16_t)((adc_value * 3300 * 2) / 4095);

  return voltage_mV;
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  LOGF("Error_Handler: code=%d\r\n", (int)g_error_code);

  // If you want it to repeat forever:
  LED_BlinkStatusCode((uint8_t)g_error_code);

  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
